experiments/results/logs/ramp-hybrid-007/wrk2.txt
Running 5m test @ http://localhost:30080/
  4 threads and 100 connections
  Thread calibration: mean lat.: 7307.345ms, rate sampling interval: 14819ms
  Thread calibration: mean lat.: 7257.702ms, rate sampling interval: 15359ms
  Thread calibration: mean lat.: 7301.939ms, rate sampling interval: 14901ms
  Thread calibration: mean lat.: 7274.086ms, rate sampling interval: 15196ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.26s    10.38s   33.49s    77.73%
    Req/Sec    25.27     25.27    77.00     74.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.83s 
 75.000%   17.97s 
 90.000%   25.59s 
 99.000%   31.33s 
 99.900%   33.16s 
 99.990%   33.44s 
 99.999%   33.51s 
100.000%   33.51s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.543     0.000000            1         1.00
       1.837     0.100000         2989         1.11
       2.437     0.200000         5976         1.25
       3.669     0.300000         8955         1.43
      15.103     0.400000        11940         1.67
    4825.087     0.500000        14925         2.00
    7618.559     0.550000        16418         2.22
   10444.799     0.600000        17914         2.50
   12918.783     0.650000        19407         2.86
   15204.351     0.700000        20897         3.33
   17973.247     0.750000        22391         4.00
   19595.263     0.775000        23146         4.44
   20742.143     0.800000        23881         5.00
   22003.711     0.825000        24633         5.71
   23429.119     0.850000        25384         6.67
   24444.927     0.875000        26123         8.00
   25198.591     0.887500        26496         8.89
   25591.807     0.900000        26866        10.00
   26411.007     0.912500        27248        11.43
   27279.359     0.925000        27619        13.33
   27705.343     0.937500        27985        16.00
   28213.247     0.943750        28188        17.78
   28377.087     0.950000        28363        20.00
   28655.615     0.956250        28548        22.86
   29294.591     0.962500        28741        26.67
   29507.583     0.968750        28921        32.00
   30179.327     0.971875        29018        35.56
   30244.863     0.975000        29116        40.00
   30326.783     0.978125        29204        45.71
   30474.239     0.981250        29297        53.33
   31162.367     0.984375        29390        64.00
   31195.135     0.985938        29444        71.11
   31244.287     0.987500        29500        80.00
   31277.055     0.989062        29527        91.43
   31358.975     0.990625        29571       106.67
   31539.199     0.992188        29619       128.00
   32112.639     0.992969        29643       142.22
   32161.791     0.993750        29670       160.00
   32178.175     0.994531        29691       182.86
   32210.943     0.995313        29717       213.33
   32243.711     0.996094        29738       256.00
   32260.095     0.996484        29747       284.44
   32292.863     0.996875        29762       320.00
   32309.247     0.997266        29771       365.71
   32358.399     0.997656        29781       426.67
   32440.319     0.998047        29792       512.00
   32473.087     0.998242        29798       568.89
   32538.623     0.998437        29804       640.00
   32587.775     0.998633        29810       731.43
   33144.831     0.998828        29817       853.33
   33177.599     0.999023        29825      1024.00
   33177.599     0.999121        29825      1137.78
   33193.983     0.999219        29830      1280.00
   33193.983     0.999316        29830      1462.86
   33226.751     0.999414        29834      1706.67
   33243.135     0.999512        29836      2048.00
   33275.903     0.999561        29837      2275.56
   33341.439     0.999609        29840      2560.00
   33341.439     0.999658        29840      2925.71
   33374.207     0.999707        29843      3413.33
   33374.207     0.999756        29843      4096.00
   33390.591     0.999780        29844      4551.11
   33406.975     0.999805        29845      5120.00
   33406.975     0.999829        29845      5851.43
   33423.359     0.999854        29846      6826.67
   33439.743     0.999878        29848      8192.00
   33439.743     0.999890        29848      9102.22
   33439.743     0.999902        29848     10240.00
   33439.743     0.999915        29848     11702.86
   33439.743     0.999927        29848     13653.33
   33456.127     0.999939        29849     16384.00
   33456.127     0.999945        29849     18204.44
   33456.127     0.999951        29849     20480.00
   33456.127     0.999957        29849     23405.71
   33456.127     0.999963        29849     27306.67
   33505.279     0.999969        29850     32768.00
   33505.279     1.000000        29850          inf
#[Mean    =     9256.239, StdDeviation   =    10382.274]
#[Max     =    33488.896, Total count    =        29850]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29955 requests in 5.00m, 159.18MB read
  Socket errors: connect 0, read 0, write 0, timeout 6610
  Non-2xx or 3xx responses: 28731
Requests/sec:     99.85
Transfer/sec:    543.32KB